import { motion } from "framer-motion";
import { Link } from "react-router-dom";

export default function SmartContracts() {
  return (
    <>
      <header>
        <title>TDB | Смарт контракти</title>
      </header>
      <motion.div
        initial={{ opacity: 0 }}
        animate={{ opacity: 1 }}
        transition={{ duration: 1.5, ease: "easeOut" }}
        className="max-w-5xl max-h-screen mx-auto py-12 text-gray-400 bg-transparent backdrop-blur-xl rounded-xl p-6 overflow-y-auto"
      >
        <h1 className="text-4xl font-bold text-gray-300 mb-6">
          Смарт контракти и одити
        </h1>

        <p className="text-lg text-gray-400 mb-4">
          Смарт контрактите са самоуправляващи се програми, които изпълняват
          определени действия автоматично, когато са изпълнени зададените
          условия. Те работят върху блокчейн мрежи като Ethereum и BNB Smart
          Chain.
        </p>

        <h2 className="text-2xl font-semibold text-teal-400 mt-6">
          Как работят смарт контрактите?
        </h2>
        <p className="text-gray-400 mb-4">
          Смарт контрактите елиминират нуждата от посредници, като изпълняват
          логиката си автоматично след подписването. Кодът на контракта се
          съхранява в блокчейна и е неизменяем.
        </p>

        <h2 className="text-2xl font-semibold text-purple-300 mt-6">
          Одитиране на смарт контракти
        </h2>
        <p className="text-gray-400 mb-4">
          Одитирането е процесът на преглед на кода на смарт контрактите, за да
          се гарантира, че няма уязвимости. Това включва анализ на сигурността,
          тестване и симулация на потенциални атаки.
        </p>

        <h3 className="text-xl font-semibold text-pink-400 mt-6">
          Популярни компании за одит
        </h3>
        <ul className="list-disc pl-6 text-gray-400 mb-4">
          <li>Spearbit</li>
          <li>Trail Of Bits</li>
          <li>Pashov Audit Group</li>
          <li>Cyfrin</li>
          <li>MixBytes</li>
          <li>Certora</li>
          <li>Blackthorn</li>
        </ul>

        <h3 className="text-xl font-semibold text-teal-500 mt-6">
          Примерен Solidity код на смарт контракт
        </h3>
        <pre className="bg-gray-800 p-4 rounded-lg overflow-x-auto text-gray-300">
          <p className="flex flex-col">
            {`
            SPDX-License-Identifier: MIT //
            pragma solidity ^0.8.0; 

            contract SimpleContract {
              address public owner;
              constructor() {
              owner = msg.sender;
            }`}
          </p>
        </pre>

        <p className="text-gray-400 mt-6">
          Ако искате да научите повече за смарт контрактите, посетете
          <Link
            to="https://ethereum.org/en/developers/docs/smart-contracts/"
            className="text-blue-300 underline"
          >
            {" "}
            официалната документация на Ethereum
          </Link>
          .
        </p>


        <div>
          <h1 className="text-3xl font-bold mb-6 text-primary mt-12">Умни договори (Smart Contracts)</h1>

          <p className="mb-4">
            Умните/Интелигентни договори, от английски език „Smart contracts”, представляват автоматично изпълняващи се цифрови споразумения,
            съхранявани в блокчейн, които се изпълняват при настъпване на предварително определени условия.
          </p>
          <p className="mb-4">
            Можете да си ги представите като самостоятелни програми, които обработват транзакции и споразумения без необходимост от посредници или доверени лица.
          </p>
          <p className="mb-4">
            Умните договори автоматизират транзакциите на децентрализирани крипто борси (DEX), като елиминират необходимостта от посредници.
            Например, при закупуване на Wrapped Bitcoin (WBTC) или Етериум (ETH) на платформи като Uniswap, умен договор автоматично потвърждава и изпълнява транзакцията.
            Вероятно не забелязвате колко често взаимодействате с тези договори, но те са основен елемент на криптоиндустрията и Уеб 3, особено в децентрализираните приложения (DApps).
          </p>
          <p className="mb-6">
            В тази статия ще ви разкрие как работят умните договори, как трансформират различни индустрии и какви са техните предимства и недостатъци.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4 text-primary">Какво е Умен Договор в Блокчейн?</h2>
          <p className="mb-4">
            Умните договори, известни още като смарт контракти, са програмирани споразумения, внедрени в блокчейн, които автоматично проверяват,
            изпълняват и улесняват условията между участниците. Те са изключително гъвкави и могат да бъдат програмирани за задействане на различни действия,
            въз основа на предварително зададени условия.
          </p>
          <p className="mb-4">
            Работният процес на смарт контрактите се основава на децентрализирана мрежа от компютри (възли), които обработват информацията в блокчейн.
            Когато всички условия, заложени в кода, са изпълнени, договорът се счита за финализиран, а процесът приключва автоматично.
          </p>
          <p className="mb-4">
            Една от ключовите ползи на блокчейн технологията е автоматизацията на процеси, които обикновено биха изисквали посредничеството на трета страна.
            Например, при международни парични преводи обикновено се изисква намесата на банки, което отнема време (понякога дни) и по-високи трансакционни такси.
          </p>
          <p className="mb-4">
            С интелигентните договори този процес се осъществява автоматично и бързо, като намалява разходите и времето за изпълнение до секунди.
            Основните предимства на умните договори биват:
          </p>

          <ul className="list-disc list-inside mb-6 space-y-2">
            <li><strong>Ефективност и прецизност:</strong> Пълната автоматизация при изпълнението на договорените условия премахва риска от човешки грешки и ускорява процесите.</li>
            <li><strong>Доверие и прозрачност:</strong> Благодарение на криптирането на данни в блокчейн, информацията е защитена и лесна за проследяване от всички участници.</li>
            <li><strong>Сигурност:</strong> Умните договори използват криптография, като всяка промяна би изисквала мащабни модификации във веригата, което прави хакерските атаки практически невъзможни.</li>
            <li><strong>Икономия:</strong> Елиминирането на посредниците води до по-ниски разходи и по-ефективно изпълнение на договорите.</li>
          </ul>

          <h2 className="text-2xl font-semibold mt-8 mb-4  text-primary">История на Умните Договори</h2>
          <p className="mb-4">
            Концепцията за умните договори води началото си от ранните 90-те години, когато американският криптограф и визионер Ник Сабо
            за първи път излага идеята за дигитални споразумения, които автоматично се изпълняват при определени условия.
            Сабо описва умните договори като „дигитален набор от обещания, оформени в код и придружени от протоколи, които гарантират изпълнението им от всички страни.”
          </p>
          <p className="mb-4">
            Няколко години по-късно Сабо разработва идеята за “Bit Gold” – една от първите форми на дигитална валута,
            която служи като основа за съвременните криптовалути.
            С появата на Биткойн през 2009г. блокчейн технологията разкри нови възможности и иновации, като внедряване и употреба на Умни договори.
          </p>
          <p className="mb-6">
            Масовата интеграция настъпи през 2015г. със стартирането на Етериум – пионер в изграждането на платформа за внедряване и управление на Умни договори.
            Тя позволява на разработчиците да създават и съчетават Децентрализирани приложения и договори,
            които работят независимо от централизирани органи или финансови институции.
          </p>

          <h2 className="text-2xl font-semibold mt-8 mb-4  text-primary">Как Работят Умните Договори?</h2>
          <p className="mb-4">
            Умните договори са компютърни програми или протоколи, които определят условията за споразумение между страни,
            извършващи транзакции в блокчейн. Тези дигитални договори се активират автоматично при изпълнение на предварително зададени условия,
            следвайки логиката „ако… тогава…“.
          </p>
          <p className="mb-4">
            След като умен договор бъде внедрен в блокчейн, той става неизменна част от мрежата и не може да бъде променян или манипулиран.
            Изпълнението на условията се проверява от децентрализирана мрежа от възли (компютри), като всяко действие се потвърждава и записва в блокчейна.
            Това гарантира сигурност, прозрачност и елиминира риска от човешки грешки или злонамерени намеси.
          </p>
          <p className="mb-4">
            Едно от основните предимства на умните договори е, че спестяват време и разходи, като същевременно намаляват правните рискове и потенциалните спорове
            чрез ясно дефинирани и автоматично изпълнявани условия.
            Благодарение на тези характеристики, умните договори преобразяват традиционните бизнес модели и са ключов елемент
            в дигиталната трансформация на индустрии по света.
          </p>
        </div>
      </motion.div>
    </>
  );
}
